Documents/ПрекращениеПредоставленияВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПрекращениеПредоставленияВычетовИПН</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрименениеВычетовИПН</xr:Item>
				<xr:Item>InformationRegister.ВычетыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ЛьготыФизическихЛицИПН</xr:Item>
				<xr:Item>InformationRegister.ПрочиеВычетыФизическихЛицИПН</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛьготыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЛьготыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредоставлятьЛьготу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КатегорияЛицаПолучателяЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииЛицПолучателейЛьготИПН</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВычетыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ВычетыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПредоставлятьВычет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрочиеВычетыФизическихЛицИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрочиеВычетыФизическихЛицИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВычета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВычетовИПН</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействуетС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрименениеВычетовИПН.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ПрименениеВычетовИПН</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПрекращениеПредоставленияВычетовИПН/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подсистема "Управление доступом".

// Процедура ЗаполнитьНаборыЗначенийДоступа по свойствам объекта заполняет наборы значений доступа
// в таблице с полями:
//    НомерНабора     - Число                                     (необязательно, если набор один),
//    ВидДоступа      - ПланВидовХарактеристикСсылка.ВидыДоступа, (обязательно),
//    ЗначениеДоступа - Неопределено, СправочникСсылка или др.    (обязательно),
//    Чтение          - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Добавление      - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Изменение       - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//    Удаление        - Булево (необязательно, если набор для всех прав) устанавливается для одной строки набора,
//
//  Вызывается из процедуры УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа(),
// если объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьНаборыЗначенийДоступа" и
// из таких же процедур объектов, у которых наборы значений доступа зависят от наборов этого
// объекта (в этом случае объект зарегистрирован в "ПодпискаНаСобытие.ЗаписатьЗависимыеНаборыЗначенийДоступа").
//
// Параметры:
//  Таблица      - ТабличнаяЧасть,
//                 РегистрСведенийНаборЗаписей.НаборыЗначенийДоступа,
//                 ТаблицаЗначений, возвращаемая УправлениеДоступом.ТаблицаНаборыЗначенийДоступа().
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	ЗарплатаКадры.ЗаполнитьНаборыПоОрганизацииИФизическимЛицам(ЭтотОбъект, Таблица, "Организация", "Сотрудник");
	
КонецПроцедуры

// Подсистема "Управление доступом".

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	ДанныеДляПроведения = ДанныеДляПроведения();
	
	// если нет вычетов для прекращения, данные ПрименениеВычетовИПН должны отсутствовать
	Если ДанныеДляПроведения.ИзменитьСтандартныйВычет
		ИЛИ ДанныеДляПроведения.ИзменитьЛьготу
		ИЛИ ДанныеДляПроведения.ИзменитьПрочиеВычеты Тогда
		
		УчетНалоговВзносовОтчислений.СформироватьПрименениеСтандартныхВычетов(Движения, Отказ, ДанныеДляПроведения, , Ложь);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на дубли движений
	Запрос = Новый Запрос;
	Запрос.Текст = Документы.ПрекращениеПредоставленияВычетовИПН.ТекстЗапросаКонфликтующиеРегистраторы();
	
	Запрос.УстановитьПараметр("ФизическоеЛицо",	Сотрудник);
	Запрос.УстановитьПараметр("Период",			Месяц);
	Запрос.УстановитьПараметр("Регистратор",	Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = НСтр("ru = 'Не удалось провести документ. Требуемые изменения вычетов необходимо провести в документе %1.'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, Выборка.Регистратор);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Выборка.Регистратор.ПолучитьОбъект());
			Отказ = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДляПроведения()
	
	ДатаКонтроля = '2018-01-01';
	
	ДанныеОВычетах = Новый Структура(
		"МесяцРегистрации,ФизическоеЛицо,Организация,
		|ИзменитьСтандартныйВычет, 
		|ИзменитьЛьготу,
		|ИзменитьПрочиеВычеты,ПрочиеВычеты");
	
	ДанныеОВычетах.ИзменитьЛьготу = СведенияОЛьготе();
	
	ЗаполнитьЗначенияСвойств(ДанныеОВычетах, СведенияДляПрекращенияВычетов());
	
	ДанныеОВычетах.Вставить("ПрочиеВычеты", СведенияОПрочихВычетах(ДанныеОВычетах));
	ДанныеОВычетах.ИзменитьПрочиеВычеты = ДанныеОВычетах.ПрочиеВычеты.Количество() > 0;
	
	Если ДанныеОВычетах.МесяцРегистрации >= ДатаКонтроля Тогда
		
		ДанныеОВычетах.Вставить("Вычеты", СведенияОВычетах(ДанныеОВычетах));
		
		ДанныеОВычетах.ИзменитьСтандартныйВычет = Ложь;
		
		Если ДанныеОВычетах.Вычеты.Количество() > 0 Тогда
			ДанныеОВычетах.ИзменитьСтандартныйВычет = Истина;
		КонецЕсли;
		
	Иначе
		
		ДанныеОВычетах.ИзменитьСтандартныйВычет = СведенияОСтандартныхВычетах();
		
	КонецЕсли;
	
	Возврат ДанныеОВычетах;
	
КонецФункции

Функция СведенияДляПрекращенияВычетов()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Док.Месяц КАК МесяцРегистрации,
	|	Док.Сотрудник КАК ФизическоеЛицо,
	|	Док.Организация КАК Организация
	|ИЗ
	|	Документ.ПрекращениеПредоставленияВычетовИПН КАК Док
	|ГДЕ
	|	Док.Ссылка = &Документ";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Документ", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция СведенияОЛьготе()
	
	ИзменитьЛьготу = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", Сотрудник);
	Запрос.УстановитьПараметр("Месяц", Месяц);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата(1,1,1));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ЛьготыФизическихЛицИПН.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_Максимум
	|ИЗ
	|	РегистрСведений.ЛьготыФизическихЛицИПН КАК ЛьготыФизическихЛицИПН
	|ГДЕ
	|	ЛьготыФизическихЛицИПН.Период < &Месяц
	|	И ВЫБОР
	|			КОГДА ЛьготыФизическихЛицИПН.ДействуетДо = &ПустаяДата
	|				ТОГДА ЛьготыФизическихЛицИПН.ПредоставлятьЛьготу
	|			ИНАЧЕ ЛьготыФизическихЛицИПН.ДействуетДо >= &Месяц
	|		КОНЕЦ
	|	И ЛьготыФизическихЛицИПН.ФизическоеЛицо = &ФизическоеЛицо
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЛьготыФизическихЛицИПН.ПредоставлятьЛьготу
	|ИЗ
	|	РегистрСведений.ЛьготыФизическихЛицИПН КАК ЛьготыФизическихЛицИПН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Максимум КАК ВТ_Максимум
	|		ПО ЛьготыФизическихЛицИПН.Период = ВТ_Максимум.Период
	|			И (ЛьготыФизическихЛицИПН.ФизическоеЛицо = &ФизическоеЛицо)";
	
	ЛьготыВыборка =  Запрос.Выполнить().Выбрать();
	
	Если ЛьготыВыборка.Следующий() Тогда
		ИзменитьЛьготу = Истина;
	Иначе
		ИзменитьЛьготу = Ложь;
	КонецЕсли;
	
	Возврат ИзменитьЛьготу;
	
КонецФункции

Функция СведенияОСтандартныхВычетах()
	
	// стандартный вычет до 2018 года  
	ИзменитьСтандартныйВычет = Ложь;
	
	ДатаКонтроля = '2018-01-01';
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо", Сотрудник);
	Запрос.УстановитьПараметр("Месяц", Месяц);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаКонтроля",	ДатаКонтроля);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВычетыФизическихЛицИПН.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_Максимум
		|ИЗ
		|	РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|ГДЕ
		|	ВычетыФизическихЛицИПН.Период < &Месяц
		|	И ВычетыФизическихЛицИПН.ВидВычета = ЗНАЧЕНИЕ(Справочник.ВидыВычетовИПН.ПустаяСсылка)
		|	И ВычетыФизическихЛицИПН.Период < &ДатаКонтроля
		|	И ВычетыФизическихЛицИПН.ФизическоеЛицо = &ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВычетыФизическихЛицИПН.ПредоставлятьВычет
		|ИЗ
		|	РегистрСведений.ВычетыФизическихЛицИПН КАК ВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Максимум КАК ВТ_Максимум
		|		ПО ВычетыФизическихЛицИПН.Период = ВТ_Максимум.Период
		|			И (ВычетыФизическихЛицИПН.ФизическоеЛицо = &ФизическоеЛицо)";
	
	СтандартныеВычетыВыборка =  Запрос.Выполнить().Выбрать();
	
	Если СтандартныеВычетыВыборка.Следующий() Тогда
		ИзменитьСтандартныйВычет = Истина;
	Иначе
		ИзменитьСтандартныйВычет = Ложь;
	КонецЕсли;
	
	Возврат ИзменитьСтандартныйВычет;
	
КонецФункции

Функция СведенияОПрочихВычетах(ДанныеОВычетах)
	
	ДатаКонтроля = '2018-01-01';
	
	Если Месяц < ДатаКонтроля Тогда
		
		ТаблицаПрочиеВычеты = Новый ТаблицаЗначений;
		ТаблицаПрочиеВычеты.Колонки.Добавить("ФизическоеЛицо");
		ТаблицаПрочиеВычеты.Колонки.Добавить("МесяцРегистрации");
		ТаблицаПрочиеВычеты.Колонки.Добавить("ВидВычета");
		ТаблицаПрочиеВычеты.Колонки.Добавить("ДействуетС");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ФизическоеЛицо", Сотрудник);
		Запрос.УстановитьПараметр("Месяц", Месяц);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПрочиеВычетыФизическихЛицИПН.Период) КАК Период
		|ПОМЕСТИТЬ ВТ_Максимум
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|ГДЕ
		|	ПрочиеВычетыФизическихЛицИПН.Период < &Месяц
		|	И ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо = &ФизическоеЛицо
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН КАК ПрочиеВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Максимум КАК ВТ_Максимум
		|		ПО ПрочиеВычетыФизическихЛицИПН.Период = ВТ_Максимум.Период
		|			И (ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо = &ФизическоеЛицо)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета";
		
		ПрочиеВычетыВыборка =  Запрос.Выполнить().Выбрать();
		
		Пока ПрочиеВычетыВыборка.Следующий() Цикл
			
			ЗаписьОПрочихВычетах = ТаблицаПрочиеВычеты.Добавить();
			
			ЗаписьОПрочихВычетах.ФизическоеЛицо		= ДанныеОВычетах.ФизическоеЛицо;
			ЗаписьОПрочихВычетах.МесяцРегистрации	= ДанныеОВычетах.МесяцРегистрации;
			ЗаписьОПрочихВычетах.ВидВычета			= ПрочиеВычетыВыборка.ВидВычетаИПН;
			ЗаписьОПрочихВычетах.ДействуетС			= ПрочиеВычетыВыборка.ДействуетС;
			
		КонецЦикла;
		
	Иначе
		
		ТаблицаПрочиеВычеты = Новый ТаблицаЗначений;
		ТаблицаПрочиеВычеты.Колонки.Добавить("ФизическоеЛицо");
		ТаблицаПрочиеВычеты.Колонки.Добавить("МесяцРегистрации");
		ТаблицаПрочиеВычеты.Колонки.Добавить("ВидВычета");
		ТаблицаПрочиеВычеты.Колонки.Добавить("Размер");
		ТаблицаПрочиеВычеты.Колонки.Добавить("ДействуетС");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ФизическоеЛицо", Сотрудник);
		Запрос.УстановитьПараметр("Месяц", Месяц);
		Запрос.УстановитьПараметр("ПустаяДата",		Дата(1,1,1));
		Запрос.УстановитьПараметр("ДатаКонтроля",	ДатаКонтроля);
		Запрос.УстановитьПараметр("Организация",	Организация);
		Запрос.УстановитьПараметр("Регистратор",	Ссылка);
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПрименениеВычетовИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
		|ПОМЕСТИТЬ ВТ_МестоПримененияВычетов
		|ИЗ
		|	РегистрСведений.ПрименениеВычетовИПН.СрезПоследних(
		|			&Месяц,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И НЕ Регистратор = &Регистратор) КАК ПрименениеВычетовИПНСрезПоследних
		|ГДЕ
		|	ПрименениеВычетовИПНСрезПоследних.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН,
		|	ПрочиеВычетыФизическихЛицИПН.ДействуетС КАК ДействуетС
		|ИЗ
		|	РегистрСведений.ПрочиеВычетыФизическихЛицИПН.СрезПоследних(
		|			&Месяц,
		|			ФизическоеЛицо = &ФизическоеЛицо
		|				И Регистратор <> &Регистратор) КАК ПрочиеВычетыФизическихЛицИПН
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
		|		ПО МестоПримененияВычетов.ФизическоеЛицо = ПрочиеВычетыФизическихЛицИПН.ФизическоеЛицо
		|ГДЕ
		|	ПрочиеВычетыФизическихЛицИПН.Период >= &ДатаКонтроля
		|	И ВЫБОР
		|			КОГДА ПрочиеВычетыФизическихЛицИПН.ДействуетПо = &ПустаяДата
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ПрочиеВычетыФизическихЛицИПН.ДействуетПо >= &Месяц
		|		КОНЕЦ
		|	И ПрочиеВычетыФизическихЛицИПН.Размер <> 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПрочиеВычетыФизическихЛицИПН.ВидВычета,
		|	ДействуетС";
		
		ПрочиеВычетыВыборка =  Запрос.Выполнить().Выбрать();
		
		Пока ПрочиеВычетыВыборка.Следующий() Цикл
			
			ЗаписьОПрочихВычетах = ТаблицаПрочиеВычеты.Добавить();
			
			ЗаписьОПрочихВычетах.ФизическоеЛицо		= ДанныеОВычетах.ФизическоеЛицо;
			ЗаписьОПрочихВычетах.МесяцРегистрации	= ДанныеОВычетах.МесяцРегистрации;
			ЗаписьОПрочихВычетах.ВидВычета			= ПрочиеВычетыВыборка.ВидВычетаИПН;
			ЗаписьОПрочихВычетах.Размер				= 0;
			ЗаписьОПрочихВычетах.ДействуетС			= ПрочиеВычетыВыборка.ДействуетС;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат ТаблицаПрочиеВычеты;
	
КонецФункции

Функция СведенияОВычетах(ДанныеОВычетах)
	
	ДатаКонтроля = '2018-01-01';
	
	ТаблицаВычеты = Новый ТаблицаЗначений;
	ТаблицаВычеты.Колонки.Добавить("ФизическоеЛицо");
	ТаблицаВычеты.Колонки.Добавить("МесяцРегистрации");
	ТаблицаВычеты.Колонки.Добавить("ВидВычета");
	ТаблицаВычеты.Колонки.Добавить("ПредоставлятьВычет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ФизическоеЛицо",	Сотрудник);
	Запрос.УстановитьПараметр("Месяц",			Месяц);
	Запрос.УстановитьПараметр("ПустаяДата",		Дата(1,1,1));
	Запрос.УстановитьПараметр("ДатаКонтроля",	ДатаКонтроля);
	Запрос.УстановитьПараметр("Регистратор",	Ссылка);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПрименениеВычетовИПНСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо
	|ПОМЕСТИТЬ ВТ_МестоПримененияВычетов
	|ИЗ
	|	РегистрСведений.ПрименениеВычетовИПН.СрезПоследних(
	|			&Месяц,
	|			ФизическоеЛицо = &ФизическоеЛицо
	|				И НЕ Регистратор = &Регистратор) КАК ПрименениеВычетовИПНСрезПоследних
	|ГДЕ
	|	ПрименениеВычетовИПНСрезПоследних.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВычетыФизическихЛицИПН.ВидВычета КАК ВидВычетаИПН
	|ИЗ
	|	РегистрСведений.ВычетыФизическихЛицИПН.СрезПоследних(
	|			&Месяц,
	|			ФизическоеЛицо = &ФизическоеЛицо
	|				И Регистратор <> &Регистратор) КАК ВычетыФизическихЛицИПН
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МестоПримененияВычетов КАК МестоПримененияВычетов
	|		ПО МестоПримененияВычетов.ФизическоеЛицо = ВычетыФизическихЛицИПН.ФизическоеЛицо
	|ГДЕ
	|	ВычетыФизическихЛицИПН.Период >= &ДатаКонтроля
	|	И ВЫБОР
	|			КОГДА ВычетыФизическихЛицИПН.ДействуетПо = &ПустаяДата
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВычетыФизическихЛицИПН.ДействуетПо >= &Месяц
	|		КОНЕЦ
	|	И ВычетыФизическихЛицИПН.ПредоставлятьВычет = ИСТИНА";
	
	ВычетыВыборка =  Запрос.Выполнить().Выбрать();
	
	Пока ВычетыВыборка.Следующий() Цикл
		
		ЗаписьОВычетах = ТаблицаВычеты.Добавить();
		
		ЗаписьОВычетах.ФизическоеЛицо		= ДанныеОВычетах.ФизическоеЛицо;
		ЗаписьОВычетах.МесяцРегистрации		= ДанныеОВычетах.МесяцРегистрации;
		ЗаписьОВычетах.ВидВычета			= ВычетыВыборка.ВидВычетаИПН;
		ЗаписьОВычетах.ПредоставлятьВычет	= Ложь;
		
	КонецЦикла;
	
	Возврат ТаблицаВычеты;
	
КонецФункции

#КонецОбласти

#КонецЕсли
